app/controllers/api/v1/tasks_controller.rb

  def index
    tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

  def show
    render json: Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]